app/views/api/products/show.json.jbuilder

json.product_reviews do
    @product.reviews.each do |review|
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = $1  [["product_id", 50]]